gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/Libraries/CTWing/ctwingaepcodes.c
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_BASICINFO);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)srcStruct.SN, 8);
	index += 8 * 2;
	
	tempLen = aep_htons(srcStruct.ModelType.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.ModelType.str, srcStruct.ModelType.len);
	index += srcStruct.ModelType.len * 2;
	
	tempLen = aep_htons(srcStruct.Vender.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Vender.str, srcStruct.Vender.len);
	index += srcStruct.Vender.len * 2;
	
	tempLen = aep_htons(srcStruct.Hard.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Hard.str, srcStruct.Hard.len);
	index += srcStruct.Hard.len * 2;
	
	tempLen = aep_htons(srcStruct.Soft.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Soft.str, srcStruct.Soft.len);
	index += srcStruct.Soft.len * 2;
	
	tempLen = aep_htons(srcStruct.Sim.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Sim.str, srcStruct.Sim.len);
	index += srcStruct.Sim.len * 2;
	
	tempLen = aep_htons(srcStruct.Imei.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Imei.str, srcStruct.Imei.len);
	index += srcStruct.Imei.len * 2;
	
	tempLen = aep_htons(srcStruct.Imsi.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Imsi.str, srcStruct.Imsi.len);
	index += srcStruct.Imsi.len * 2;
	
	tempLen = aep_htons(srcStruct.Nbvender.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Nbvender.str, srcStruct.Nbvender.len);
	index += srcStruct.Nbvender.len * 2;
	
	tempLen = aep_htons(srcStruct.Nbmode.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Nbmode.str, srcStruct.Nbmode.len);
	index += srcStruct.Nbmode.len * 2;
	
	tempLen = aep_htons(srcStruct.Boot.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Boot.str, srcStruct.Boot.len);
	index += srcStruct.Boot.len * 2;
	
	tempLen = aep_htons(srcStruct.Ver.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Ver.str, srcStruct.Ver.len);
	index += srcStruct.Ver.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Rmold, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.Rvcc, 1);
	index += 1 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_DynamicInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepDynamicInfo srcStruct)
 @Description			CTWing_DynamicInfo_CodeDataReport			: 序列化DynamicInfo
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_DynamicInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepDynamicInfo srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 26 + (srcStruct.RAlib.len + 2) + (srcStruct.Nbrun.len + 2) + (srcStruct.Gain.len + 2) + (srcStruct.x.len + 2) + (srcStruct.y.len + 2) + (srcStruct.z.len + 2);
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.RT						= aep_htoni(srcStruct.RT);
	srcStruct.Batt						= aep_htons(srcStruct.Batt);
	srcStruct.Rcnt						= aep_htoni(srcStruct.Rcnt);
	srcStruct.Temp						= aep_htons(srcStruct.Temp);
	srcStruct.Qmcrbt					= aep_htons(srcStruct.Qmcrbt);
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_DYNAMICINFO);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)srcStruct.SN, 8);
	index += 8 * 2;
	
	HexToStr(index, (char *)&srcStruct.RT, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.Batt, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.RAlib.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.RAlib.str, srcStruct.RAlib.len);
	index += srcStruct.RAlib.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Rcnt, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.Temp, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.Qmcrbt, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.Nbrun.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Nbrun.str, srcStruct.Nbrun.len);
	index += srcStruct.Nbrun.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Indelay, 1);
	index += 1 * 2;
	
	tempLen = aep_htons(srcStruct.Gain.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Gain.str, srcStruct.Gain.len);
	index += srcStruct.Gain.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Smode, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.Sinter, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.hpass, 1);
	index += 1 * 2;
	
	tempLen = aep_htons(srcStruct.x.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.x.str, srcStruct.x.len);
	index += srcStruct.x.len * 2;
	
	tempLen = aep_htons(srcStruct.y.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.y.str, srcStruct.y.len);
	index += srcStruct.y.len * 2;
	
	tempLen = aep_htons(srcStruct.z.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.z.str, srcStruct.z.len);
	index += srcStruct.z.len * 2;
	
	return resultStruct;
}
#endif

#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_2
/**********************************************************************************************************
 @Function			void CTWing_Message_Operate_Creat_Data_Report(CTWING_ClientsTypeDef* pClient, AepDataReportData * srcStruct)
 @Description			CTWing_Message_Operate_Creat_Data_Report	: 填写DataReport数据
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
void CTWing_Message_Operate_Creat_Data_Report(CTWING_ClientsTypeDef* pClient, AepDataReportData * srcStruct)
{
	srcStruct->battery_voltage	= ((float)TCFG_Utility_Get_Device_Batt_ShortVal() / 100.0);
	srcStruct->battery_value		= (100 - (int)(TCFG_Utility_Get_Run_Time() / 946080)) < 0 ? 0 : (100 - (int)(TCFG_Utility_Get_Run_Time() / 946080));
	srcStruct->error_code		= 0;
}

/**********************************************************************************************************
 @Function			void CTWing_Message_Operate_Creat_Signal_Report(CTWING_ClientsTypeDef* pClient, AepSignalReportData * srcStruct)
 @Description			CTWing_Message_Operate_Creat_Signal_Report	: 填写SignalReport数据
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
void CTWing_Message_Operate_Creat_Signal_Report(CTWING_ClientsTypeDef* pClient, AepSignalReportData * srcStruct)
{
	srcStruct->rsrp			= TCFG_Utility_Get_Nbiot_CellRsrp();
	srcStruct->sinr			= TCFG_Utility_Get_Nbiot_CellSnr();
	srcStruct->pci				= TCFG_Utility_Get_Nbiot_RadioPCI();
	srcStruct->ecl				= TCFG_Utility_Get_Nbiot_RadioECL();
	srcStruct->cell_id			= TCFG_Utility_Get_Nbiot_RadioCellID();
}

/**********************************************************************************************************
 @Function			void CTWing_Message_Operate_Creat_Heart_Beat(CTWING_ClientsTypeDef* pClient, AepHeartBeatData * srcStruct)
 @Description			CTWing_Message_Operate_Creat_Heart_Beat		: 填写HeartBeat数据
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
void CTWing_Message_Operate_Creat_Heart_Beat(CTWING_ClientsTypeDef* pClient, AepHeartBeatData * srcStruct)
{
	memset((void *)srcStruct->ICCID, 0x0, sizeof(srcStruct->ICCID));
	memcpy((void *)srcStruct->ICCID, (void *)TCFG_Utility_Get_Nbiot_Iccid_String(), sizeof(srcStruct->ICCID));
	srcStruct->heartbeat_time	= (float)(TCFG_EEPROM_GetNbiotHeart() * 900) / (float)(60 * 60);
	srcStruct->protect_time		= (float)(CTWING_LWM2M_LIFETIME) / (float)(60 * 60);
	memset((void *)srcStruct->saas_version, 0x0, sizeof(srcStruct->saas_version));
	memcpy((void *)srcStruct->saas_version, (void *)"0.0.01", sizeof(srcStruct->saas_version));
	memset((void *)srcStruct->manufacturer_id, 0x0, sizeof(srcStruct->manufacturer_id));
	memcpy((void *)srcStruct->manufacturer_id, (void *)"91330104563048753R", sizeof(srcStruct->manufacturer_id));
	memset((void *)srcStruct->IMSI, 0x0, sizeof(srcStruct->IMSI));
	memcpy((void *)srcStruct->IMSI, (void *)TCFG_Utility_Get_Nbiot_Imsi_String(), sizeof(srcStruct->IMSI));
	memset((void *)srcStruct->IMEI, 0x0, sizeof(srcStruct->IMEI));
	memcpy((void *)srcStruct->IMEI, (void *)TCFG_Utility_Get_Nbiot_Imei_String(), sizeof(srcStruct->IMEI));
	
	srcStruct->nb_firmware.str		= TCFG_Utility_Get_Nbiot_ModelVersion();
	srcStruct->nb_firmware.len		= strlen((const char*)srcStruct->nb_firmware.str);
	srcStruct->nb_module.str			= TCFG_Utility_Get_Nbiot_Manufacturermode();
	srcStruct->nb_module.len			= strlen((const char*)srcStruct->nb_module.str);
	srcStruct->mcu_firmware.str		= TCFG_Utility_Get_Softwear_Version_String();
	srcStruct->mcu_firmware.len		= strlen((const char*)srcStruct->mcu_firmware.str);
	srcStruct->terminal_type.str		= TCFG_Utility_Get_Hardwear_Version_String();
	srcStruct->terminal_type.len		= strlen((const char*)srcStruct->terminal_type.str);
	srcStruct->manufacturer_name.str	= TCFG_EEPROM_Get_Vender_String();
	srcStruct->manufacturer_name.len	= strlen((const char*)srcStruct->manufacturer_name.str);
	
	srcStruct->rsrp			= TCFG_Utility_Get_Nbiot_CellRsrp();
	srcStruct->sinr			= TCFG_Utility_Get_Nbiot_CellSnr();
	srcStruct->pci				= TCFG_Utility_Get_Nbiot_RadioPCI();
	srcStruct->ecl				= TCFG_Utility_Get_Nbiot_RadioECL();
	srcStruct->cell_id			= TCFG_Utility_Get_Nbiot_RadioCellID();
	
	srcStruct->battery_voltage	= ((float)TCFG_Utility_Get_Device_Batt_ShortVal() / 100.0);
	srcStruct->battery_value		= (100 - (int)(TCFG_Utility_Get_Run_Time() / 946080)) < 0 ? 0 : (100 - (int)(TCFG_Utility_Get_Run_Time() / 946080));
	srcStruct->error_code		= 0;
	
