gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/Libraries/CTWing/ctwingaepcodes.c
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	index = resultStruct.str;
	
	memcpy(index, "07", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_MAGNETICDISTURB);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value, 4);
	index += 4 * 2;
	
	return resultStruct;
}
#endif

#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_3
/**********************************************************************************************************
 @Function			void CTWing_Message_Operate_Creat_Extra_Report(CTWING_ClientsTypeDef* pClient, AepExtraReportData * srcStruct)
 @Description			CTWing_Message_Operate_Creat_Extra_Report	: 填写ExtraReport数据
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
void CTWing_Message_Operate_Creat_Extra_Report(CTWING_ClientsTypeDef* pClient, AepExtraReportData * srcStruct)
{
	srcStruct->battery_voltage				= ((float)TCFG_Utility_Get_Device_Batt_ShortVal() / 100.0);
	srcStruct->battery_value					= 100;
	srcStruct->error_code					= 0;
}

/**********************************************************************************************************
 @Function			void CTWing_Message_Operate_Creat_Heart_Beat(CTWING_ClientsTypeDef* pClient, AepHeartBeatData * srcStruct)
 @Description			CTWing_Message_Operate_Creat_Heart_Beat		: 填写HeartBeat数据
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
void CTWing_Message_Operate_Creat_Heart_Beat(CTWING_ClientsTypeDef* pClient, AepHeartBeatData * srcStruct)
{
	srcStruct->battery_voltage				= ((float)TCFG_Utility_Get_Device_Batt_ShortVal() / 100.0);
	srcStruct->battery_value					= 100;
	srcStruct->error_code					= 0;
	
	srcStruct->heartbeat_time				= 4;
	srcStruct->protect_time					= 8;
	
	memset((void *)srcStruct->ICCID,			0x0,								sizeof(srcStruct->ICCID));
	memcpy((void *)srcStruct->ICCID,			(void *)AEP_MODULE_NB_ICCID,			sizeof(srcStruct->ICCID));
	memset((void *)srcStruct->saas_version,		0x0,								sizeof(srcStruct->saas_version));
	memcpy((void *)srcStruct->saas_version, 	(void *)AEP_MODULE_SAAS_VERSION,		sizeof(srcStruct->saas_version));
	memset((void *)srcStruct->manufacturer_id,	0x0,								sizeof(srcStruct->manufacturer_id));
	memcpy((void *)srcStruct->manufacturer_id,	(void *)AEP_MODULE_MANUFACTURER_ID,	sizeof(srcStruct->manufacturer_id));
	memset((void *)srcStruct->IMSI,			0x0,								sizeof(srcStruct->IMSI));
	memcpy((void *)srcStruct->IMSI,			(void *)AEP_MODULE_NB_IMSI,			sizeof(srcStruct->IMSI));
	memset((void *)srcStruct->IMEI,			0x0,								sizeof(srcStruct->IMEI));
	memcpy((void *)srcStruct->IMEI,			(void *)AEP_MODULE_NB_IMEI,			sizeof(srcStruct->IMEI));
	
	srcStruct->nb_firmware.str				= AEP_MODULE_NB_FIRMWARE;
	srcStruct->nb_firmware.len				= strlen((const char*)srcStruct->nb_firmware.str);
	srcStruct->nb_module.str					= AEP_MODULE_NB_MODULE;
	srcStruct->nb_module.len					= strlen((const char*)srcStruct->nb_module.str);
	srcStruct->mcu_firmware.str				= AEP_MODULE_MCU_FIRMWARE;
	srcStruct->mcu_firmware.len				= strlen((const char*)srcStruct->mcu_firmware.str);
	srcStruct->terminal_type.str				= AEP_MODULE_TERMINAL_TYPE;
	srcStruct->terminal_type.len				= strlen((const char*)srcStruct->terminal_type.str);
	srcStruct->manufacturer_name.str			= AEP_MODULE_MANUFACTURER_NAME;
	srcStruct->manufacturer_name.len			= strlen((const char*)srcStruct->manufacturer_name.str);
	
	srcStruct->rsrp						= AEP_MODULE_NB_RSRP;
	srcStruct->sinr						= AEP_MODULE_NB_SINR;
	srcStruct->pci							= AEP_MODULE_NB_PCI;
	srcStruct->ecl							= AEP_MODULE_NB_ECL;
	srcStruct->cell_id						= AEP_MODULE_NB_CELLID;
	
	srcStruct->signal_power					= AEP_MODULE_NB_SIGNALPOWER;
	srcStruct->snr							= AEP_MODULE_NB_SNR;
	srcStruct->tx_power						= AEP_MODULE_NB_TXPOWER;
}

#endif

#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_3
/**********************************************************************************************************
 @Function			AepString CTWing_DataReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepDataReportData srcStruct)
 @Description			CTWing_DataReport_CodeDataReport			: 序列化DataReport
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_DataReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepDataReportData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 1;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_DATAREPORT);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.parking_state, 1);
	index += 1 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_SignalReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepSignalReportData srcStruct)
 @Description			CTWing_SignalReport_CodeDataReport			: 序列化SignalReport
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_SignalReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepSignalReportData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 20;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
