gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/Libraries/CTWing/ctwingaepcodes.c
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.rsrp						= aep_htoni(srcStruct.rsrp);
	srcStruct.sinr						= aep_htoni(srcStruct.sinr);
	srcStruct.pci						= aep_htoni(srcStruct.pci);
	srcStruct.ecl						= aep_htoni(srcStruct.ecl);
	srcStruct.cell_id					= aep_htoni(srcStruct.cell_id);
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_SIGNALREPORT);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.rsrp, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.sinr, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.pci, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.ecl, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.cell_id, 4);
	index += 4 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_ExtraReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepExtraReportData srcStruct)
 @Description			CTWing_ExtraReport_CodeDataReport			: 序列化ExtraReport
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_ExtraReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepExtraReportData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 29;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.battery_voltage			= aep_htonf(srcStruct.battery_voltage);
	srcStruct.battery_value				= aep_htoni(srcStruct.battery_value);
	srcStruct.ptime					= aep_htonl(srcStruct.ptime);
	srcStruct.magnetic_value				= aep_htoni(srcStruct.magnetic_value);
	srcStruct.magnetic_value_x			= aep_htons(srcStruct.magnetic_value_x);
	srcStruct.magnetic_value_y			= aep_htons(srcStruct.magnetic_value_y);
	srcStruct.magnetic_value_z			= aep_htons(srcStruct.magnetic_value_z);
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_EXTRAREPORT);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.battery_voltage, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.battery_value, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.ptime, 8);
	index += 8 * 2;
	
	HexToStr(index, (char *)&srcStruct.parking_state, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.error_code, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.parking_change, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value_x, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value_y, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value_z, 2);
	index += 2 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_HeartBeat_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepHeartBeatData srcStruct)
 @Description			CTWing_HeartBeat_CodeDataReport			: 序列化HeartBeat
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_HeartBeat_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepHeartBeatData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 129 + (srcStruct.nb_firmware.len + 2) + (srcStruct.nb_module.len + 2) + (srcStruct.mcu_firmware.len + 2) + (srcStruct.terminal_type.len + 2) + (srcStruct.manufacturer_name.len + 2);
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.heartbeat_time				= aep_htonf(srcStruct.heartbeat_time);
	srcStruct.protect_time				= aep_htonf(srcStruct.protect_time);
	srcStruct.rsrp						= aep_htoni(srcStruct.rsrp);
	srcStruct.sinr						= aep_htoni(srcStruct.sinr);
	srcStruct.pci						= aep_htoni(srcStruct.pci);
	srcStruct.ecl						= aep_htoni(srcStruct.ecl);
	srcStruct.cell_id					= aep_htoni(srcStruct.cell_id);
	srcStruct.battery_voltage			= aep_htonf(srcStruct.battery_voltage);
	srcStruct.battery_value				= aep_htoni(srcStruct.battery_value);
	srcStruct.signal_power				= aep_htons(srcStruct.signal_power);
	srcStruct.snr						= aep_htons(srcStruct.snr);
	srcStruct.tx_power					= aep_htons(srcStruct.tx_power);
	srcStruct.magnetic_value				= aep_htoni(srcStruct.magnetic_value);
	srcStruct.magnetic_value_x			= aep_htons(srcStruct.magnetic_value_x);
	srcStruct.magnetic_value_y			= aep_htons(srcStruct.magnetic_value_y);
	srcStruct.magnetic_value_z			= aep_htons(srcStruct.magnetic_value_z);
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_HEARTBEAT);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)srcStruct.ICCID, 20);
	index += 20 * 2;
	
	HexToStr(index, (char *)&srcStruct.heartbeat_time, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.protect_time, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)srcStruct.saas_version, 6);
	index += 6 * 2;
	
	HexToStr(index, (char *)srcStruct.manufacturer_id, 18);
	index += 18 * 2;
	
	HexToStr(index, (char *)srcStruct.IMSI, 15);
	index += 15 * 2;
	
	HexToStr(index, (char *)srcStruct.IMEI, 15);
	index += 15 * 2;
	
	tempLen = aep_htons(srcStruct.nb_firmware.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.nb_firmware.str, srcStruct.nb_firmware.len);
	index += srcStruct.nb_firmware.len * 2;
	
	tempLen = aep_htons(srcStruct.nb_module.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.nb_module.str, srcStruct.nb_module.len);
	index += srcStruct.nb_module.len * 2;
	
