gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/Libraries/CTWing/ctwingaepcodes.c
	tempLen = aep_htons(srcStruct.mcu_firmware.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.mcu_firmware.str, srcStruct.mcu_firmware.len);
	index += srcStruct.mcu_firmware.len * 2;
	
	tempLen = aep_htons(srcStruct.terminal_type.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.terminal_type.str, srcStruct.terminal_type.len);
	index += srcStruct.terminal_type.len * 2;
	
	tempLen = aep_htons(srcStruct.manufacturer_name.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.manufacturer_name.str, srcStruct.manufacturer_name.len);
	index += srcStruct.manufacturer_name.len * 2;
	
	HexToStr(index, (char *)&srcStruct.rsrp, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.sinr, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.pci, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.ecl, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.cell_id, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.battery_voltage, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.battery_value, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.signal_power, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.snr, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.tx_power, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.parking_state, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.error_code, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.parking_change, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value_x, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value_y, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value_z, 2);
	index += 2 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_ParkingChangeInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepParkingChangeInfoData srcStruct)
 @Description			CTWing_ParkingChangeInfo_CodeDataReport		: 序列化ParkingChangeInfo
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_ParkingChangeInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepParkingChangeInfoData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 1;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	index = resultStruct.str;
	
	memcpy(index, "07", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_PARKINGCHANGE);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.parking_change, 1);
	index += 1 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_ErrorCodeReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepErrorCodeReportData srcStruct)
 @Description			CTWing_ErrorCodeReport_CodeDataReport		: 序列化ErrorCodeReport
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_ErrorCodeReport_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepErrorCodeReportData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 1;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	index = resultStruct.str;
	
	memcpy(index, "07", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_ERRORCODE);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.error_code, 1);
	index += 1 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_LowVoltageAlarm_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepLowVoltageAlarmData srcStruct)
 @Description			CTWing_LowVoltageAlarm_CodeDataReport		: 序列化LowVoltageAlarm
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_LowVoltageAlarm_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepLowVoltageAlarmData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 4;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.battery_voltage			= aep_htonf(srcStruct.battery_voltage);
	
	index = resultStruct.str;
	
	memcpy(index, "07", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_LOWVOLTAGE);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.battery_voltage, 4);
	index += 4 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_MagneticDisturb_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepMagneticDisturbData srcStruct)
 @Description			CTWing_MagneticDisturb_CodeDataReport		: 序列化MagneticDisturb
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_MagneticDisturb_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepMagneticDisturbData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 4;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
