gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/Libraries/CTWing/ctwingaepcodes.c
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.magnetic_value				= aep_htoni(srcStruct.magnetic_value);
	
	index = resultStruct.str;
	
	memcpy(index, "07", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_MAGNETICDISTURB);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.magnetic_value, 4);
	index += 4 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_DeviceControl_Resp_CodeDataResponse(CTWING_ClientsTypeDef* pClient, AepDeviceControlRespData srcStruct)
 @Description			CTWing_DeviceControl_Resp_CodeDataResponse	: 序列化DeviceControlResp
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_DeviceControl_Resp_CodeDataResponse(CTWING_ClientsTypeDef* pClient, AepDeviceControlRespData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 1;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	index = resultStruct.str;
	
	memcpy(index, "86", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_DEVICECTRL_RESP);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.taskId);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.command_type, 1);
	index += 1 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_HeartbeatTime_Resp_CodeDataResponse(CTWING_ClientsTypeDef* pClient, AepHeartbeatTimeRespData srcStruct)
 @Description			CTWing_HeartbeatTime_Resp_CodeDataResponse	: 序列化HeartbeatTimeResp
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_HeartbeatTime_Resp_CodeDataResponse(CTWING_ClientsTypeDef* pClient, AepHeartbeatTimeRespData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 4;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.heartbeat_time				= aep_htonf(srcStruct.heartbeat_time);
	
	index = resultStruct.str;
	
	memcpy(index, "86", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_HEARTBEAT_RESP);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.taskId);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.heartbeat_time, 4);
	index += 4 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_ProtectTime_Resp_CodeDataResponse(CTWING_ClientsTypeDef* pClient, AepProtectTimeRespData srcStruct)
 @Description			CTWing_ProtectTime_Resp_CodeDataResponse	: 序列化ProtectTimeResp
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_ProtectTime_Resp_CodeDataResponse(CTWING_ClientsTypeDef* pClient, AepProtectTimeRespData srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 4;
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.protect_time				= aep_htonf(srcStruct.protect_time);
	
	index = resultStruct.str;
	
	memcpy(index, "86", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_PROTECT_RESP);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.taskId);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.protect_time, 4);
	index += 4 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			int CTWing_DeviceControl_DecodeCmdDown(CTWING_ClientsTypeDef* pClient, char* source, AepDeviceControlCmdData* dest)
 @Description			CTWing_DeviceControl_DecodeCmdDown			: 反序列化DeviceControl
 @Input				pClient								: CTWing客户端实例
					source
					dest
 @Return				void
**********************************************************************************************************/
int CTWing_DeviceControl_DecodeCmdDown(CTWING_ClientsTypeDef* pClient, char* source, AepDeviceControlCmdData* dest)
{
	char* index = source;
	int srcStrLen = strlen(source);
	int len = 1;
	
	memset((void *)dest, 0x0, sizeof(AepDeviceControlCmdData));
	
	StrToHex((char *)&dest->command_type, index, 1);
	index += 1 * 2;
	
	if (len * 2 > srcStrLen) {
		return AEP_CMD_PAYLOAD_PARSING_FAILED;
	}
	
	return AEP_CMD_SUCCESS;
}

/**********************************************************************************************************
 @Function			int CTWing_HeartbeatTime_DecodeCmdDown(CTWING_ClientsTypeDef* pClient, char* source, AepHeartbeatTimeCmdData* dest)
 @Description			CTWing_DeviceControl_DecodeCmdDown			: 反序列化HeartbeatTime
 @Input				pClient								: CTWing客户端实例
					source
					dest
 @Return				void
**********************************************************************************************************/
int CTWing_HeartbeatTime_DecodeCmdDown(CTWING_ClientsTypeDef* pClient, char* source, AepHeartbeatTimeCmdData* dest)
{
	char* index = source;
	int srcStrLen = strlen(source);
	int len = 4;
	
	memset((void *)dest, 0x0, sizeof(AepHeartbeatTimeCmdData));
	
	StrToHex((char *)&dest->heartbeat_time, index, 4);
	dest->heartbeat_time				= aep_htonf(dest->heartbeat_time);
	index += 4 * 2;
	
	if (len * 2 > srcStrLen) {
		return AEP_CMD_PAYLOAD_PARSING_FAILED;
	}
	
	return AEP_CMD_SUCCESS;
}

/**********************************************************************************************************
 @Function			int CTWing_ProtectTime_DecodeCmdDown(CTWING_ClientsTypeDef* pClient, char* source, AepProtectTimeCmdData* dest)
 @Description			CTWing_ProtectTime_DecodeCmdDown			: 反序列化ProtectTime
 @Input				pClient								: CTWing客户端实例
					source
					dest
 @Return				void
**********************************************************************************************************/
int CTWing_ProtectTime_DecodeCmdDown(CTWING_ClientsTypeDef* pClient, char* source, AepProtectTimeCmdData* dest)
{
	char* index = source;
	int srcStrLen = strlen(source);
	int len = 4;
	
