gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/Libraries/CTWing/ctwingaepcodes.c
	memset((void *)dest, 0x0, sizeof(AepProtectTimeCmdData));
	
	StrToHex((char *)&dest->protect_time, index, 4);
	dest->protect_time					= aep_htonf(dest->protect_time);
	index += 4 * 2;
	
	if (len * 2 > srcStrLen) {
		return AEP_CMD_PAYLOAD_PARSING_FAILED;
	}
	
	return AEP_CMD_SUCCESS;
}
#endif

/**********************************************************************************************************
 @Function			AepString CTWing_CodeDataReportByIdToStr(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdToStr			: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceId
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_CodeDataReportByIdToStr(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
{
#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_1
	if (serviceId == AEP_SERVICE_ID_SPOTSTATUSDATA) {
		return CTWing_SpotStatusData_CodeDataReport(pClient, *(AepSpotStatusData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_WORKINFO) {
		return CTWing_WorkInfo_CodeDataReport(pClient, *(AepWorkInfo*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_BASICINFO) {
		return CTWing_BasicInfo_CodeDataReport(pClient, *(AepBasicInfo*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_DYNAMICINFO) {
		return CTWing_DynamicInfo_CodeDataReport(pClient, *(AepDynamicInfo*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
#endif
	
#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_2
	if (serviceId == AEP_SERVICE_ID_DATAREPORT) {
		return CTWing_DataReport_CodeDataReport(pClient, *(AepDataReportData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_SIGNALREPORT) {
		return CTWing_SignalReport_CodeDataReport(pClient, *(AepSignalReportData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_HEARTBEAT) {
		return CTWing_HeartBeat_CodeDataReport(pClient, *(AepHeartBeatData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_PARKINGCHANGE) {
		return CTWing_ParkingChangeInfo_CodeDataReport(pClient, *(AepParkingChangeInfoData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_ERRORCODE) {
		return CTWing_ErrorCodeReport_CodeDataReport(pClient, *(AepErrorCodeReportData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_LOWVOLTAGE) {
		return CTWing_LowVoltageAlarm_CodeDataReport(pClient, *(AepLowVoltageAlarmData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_MAGNETICDISTURB) {
		return CTWing_MagneticDisturb_CodeDataReport(pClient, *(AepMagneticDisturbData*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
#endif
	
#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_3
	if (serviceId == AEP_SERVICE_ID_DATAREPORT) {
		return CTWing_DataReport_CodeDataReport(pClient, *(AepDataReportData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_SIGNALREPORT) {
		return CTWing_SignalReport_CodeDataReport(pClient, *(AepSignalReportData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_EXTRAREPORT) {
		return CTWing_ExtraReport_CodeDataReport(pClient, *(AepExtraReportData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_HEARTBEAT) {
		return CTWing_HeartBeat_CodeDataReport(pClient, *(AepHeartBeatData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_PARKINGCHANGE) {
		return CTWing_ParkingChangeInfo_CodeDataReport(pClient, *(AepParkingChangeInfoData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_ERRORCODE) {
		return CTWing_ErrorCodeReport_CodeDataReport(pClient, *(AepErrorCodeReportData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_LOWVOLTAGE) {
		return CTWing_LowVoltageAlarm_CodeDataReport(pClient, *(AepLowVoltageAlarmData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_MAGNETICDISTURB) {
		return CTWing_MagneticDisturb_CodeDataReport(pClient, *(AepMagneticDisturbData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_DEVICECTRL_RESP) {
		return CTWing_DeviceControl_Resp_CodeDataResponse(pClient, *(AepDeviceControlRespData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_HEARTBEAT_RESP) {
		return CTWing_HeartbeatTime_Resp_CodeDataResponse(pClient, *(AepHeartbeatTimeRespData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_PROTECT_RESP) {
		return CTWing_ProtectTime_Resp_CodeDataResponse(pClient, *(AepProtectTimeRespData*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
#endif
}

/**********************************************************************************************************
 @Function			AepBytes CTWing_CodeDataReportByIdToBytes(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdToBytes			: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceId
					srcStruct
 @Return				void
**********************************************************************************************************/
AepBytes CTWing_CodeDataReportByIdToBytes(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
{
	AepString tempStr = CTWing_CodeDataReportByIdToStr(pClient, serviceId, srcStruct);
	AepBytes result = {0};
	result.len = tempStr.len / 2;
	if (result.len > 0) {
		memset((void *)pClient->DataProcessStack, 0x0, sizeof(pClient->DataProcessStack));
		result.str = (char *)pClient->DataProcessStack;
		StrToHex(result.str, tempStr.str, result.len);
	}
	
	return result;
}

/**********************************************************************************************************
 @Function			AepString CTWing_CodeDataReportByIdentifierToStr(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdentifierToStr		: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceIdentifier
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_CodeDataReportByIdentifierToStr(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
{
#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_1
	if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_SPOTSTATUSDATA) == 0) {
		return CTWing_SpotStatusData_CodeDataReport(pClient, *(AepSpotStatusData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_WORKINFO) == 0) {
		return CTWing_WorkInfo_CodeDataReport(pClient, *(AepWorkInfo*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_BASICINFO) == 0) {
		return CTWing_BasicInfo_CodeDataReport(pClient, *(AepBasicInfo*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_DYNAMICINFO) == 0) {
		return CTWing_DynamicInfo_CodeDataReport(pClient, *(AepDynamicInfo*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
#endif
	
#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_2
	if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_DATAREPORT) == 0) {
		return CTWing_DataReport_CodeDataReport(pClient, *(AepDataReportData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_SIGNALREPORT) == 0) {
		return CTWing_SignalReport_CodeDataReport(pClient, *(AepSignalReportData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_HEARTBEAT) == 0) {
		return CTWing_HeartBeat_CodeDataReport(pClient, *(AepHeartBeatData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_PARKINGCHANGE) == 0) {
		return CTWing_ParkingChangeInfo_CodeDataReport(pClient, *(AepParkingChangeInfoData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_ERRORCODE) == 0) {
		return CTWing_ErrorCodeReport_CodeDataReport(pClient, *(AepErrorCodeReportData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_LOWVOLTAGE) == 0) {
		return CTWing_LowVoltageAlarm_CodeDataReport(pClient, *(AepLowVoltageAlarmData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_MAGNETICDISTURB) == 0) {
		return CTWing_MagneticDisturb_CodeDataReport(pClient, *(AepMagneticDisturbData*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
#endif
	
#if CTWING_AEPMODULE_TYPE == CTWING_AEPMODULE_MVB_VD33D_P2_3
	if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_DATAREPORT) == 0) {
		return CTWing_DataReport_CodeDataReport(pClient, *(AepDataReportData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_SIGNALREPORT) == 0) {
		return CTWing_SignalReport_CodeDataReport(pClient, *(AepSignalReportData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_EXTRAREPORT) == 0) {
		return CTWing_ExtraReport_CodeDataReport(pClient, *(AepExtraReportData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_HEARTBEAT) == 0) {
		return CTWing_HeartBeat_CodeDataReport(pClient, *(AepHeartBeatData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_PARKINGCHANGE) == 0) {
		return CTWing_ParkingChangeInfo_CodeDataReport(pClient, *(AepParkingChangeInfoData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_ERRORCODE) == 0) {
		return CTWing_ErrorCodeReport_CodeDataReport(pClient, *(AepErrorCodeReportData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_LOWVOLTAGE) == 0) {
		return CTWing_LowVoltageAlarm_CodeDataReport(pClient, *(AepLowVoltageAlarmData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_MAGNETICDISTURB) == 0) {
		return CTWing_MagneticDisturb_CodeDataReport(pClient, *(AepMagneticDisturbData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_DEVICECTRL_RESP) == 0) {
		return CTWing_DeviceControl_Resp_CodeDataResponse(pClient, *(AepDeviceControlRespData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_HEARTBEAT_RESP) == 0) {
		return CTWing_HeartbeatTime_Resp_CodeDataResponse(pClient, *(AepHeartbeatTimeRespData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_PROTECT_RESP) == 0) {
		return CTWing_ProtectTime_Resp_CodeDataResponse(pClient, *(AepProtectTimeRespData*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
#endif
}

/**********************************************************************************************************
 @Function			AepBytes CTWing_CodeDataReportByIdentifierToBytes(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdentifierToBytes	: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceIdentifier
					srcStruct
 @Return				void
**********************************************************************************************************/
AepBytes CTWing_CodeDataReportByIdentifierToBytes(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
{
	AepString tempStr = CTWing_CodeDataReportByIdentifierToStr(pClient, serviceIdentifier, srcStruct);
	AepBytes result = {0};
	result.len = tempStr.len / 2;
	if (result.len > 0) {
		memset((void *)pClient->DataProcessStack, 0x0, sizeof(pClient->DataProcessStack));
		result.str = (char *)pClient->DataProcessStack;
		StrToHex(result.str, tempStr.str, result.len);
	}
	
	return result;
}

/**********************************************************************************************************
 @Function			AepCmdData CTWing_DecodeCmdDownFromStr(CTWING_ClientsTypeDef* pClient, char* source)
 @Description			CTWing_DecodeCmdDownFromStr				: 反序列化数据包
 @Input				pClient								: CTWing客户端实例
					source
 @Return				void
**********************************************************************************************************/
AepCmdData CTWing_DecodeCmdDownFromStr(CTWING_ClientsTypeDef* pClient, char* source)
{
	char* index;
	AepCmdData result;
	char cmdType;
	unsigned short serviceId;
	unsigned short payloadLen;
	
