gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/Libraries/CTWing/ctwingaepcodes.c
	memset((void *)&result, 0x0, sizeof(AepCmdData));
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	index = source;
	
	/* 解析指令类型 */
	StrToHex(&cmdType, index, 1);
	index += 1 * 2;
	if (cmdType != 0x06) {
		result.code = AEP_CMD_INVALID_DATASET_TYPE;
	}
	
	/* 服务Id解析 */
	StrToHex((char *)&serviceId, index, 2);
	serviceId = aep_htons(serviceId);
	index += 2 * 2;
	
	StrToHex((char *)&result.taskId, index, 2);
	result.taskId = aep_htons(result.taskId);
	index += 2 * 2;
	
	/* payload长度解析 */
	StrToHex((char *)&payloadLen, index, 2);
	payloadLen = aep_htons(payloadLen);
	index += 2 * 2;
	
	if (strlen(index) < payloadLen * 2) {
		result.code = AEP_CMD_PAYLOAD_PARSING_FAILED;
		return result;
	}
	
	if (serviceId == AEP_SERVICE_ID_DEVICECTRL_CMD) {
		result.serviceIdentifier = AEP_SERVICE_ENTIFIER_DEVICECTRL_CMD;
		result.serviceId = AEP_SERVICE_ID_DEVICECTRL_CMD;
		result.data = (void *)pClient->AepMallocProcessStack;
		result.code = CTWing_DeviceControl_DecodeCmdDown(pClient, index, (AepDeviceControlCmdData*)result.data);
	}
	else if (serviceId == AEP_SERVICE_ID_HEARTBEAT_CMD) {
		result.serviceIdentifier = AEP_SERVICE_ENTIFIER_HEARTBEAT_CMD;
		result.serviceId = AEP_SERVICE_ID_HEARTBEAT_CMD;
		result.data = (void *)pClient->AepMallocProcessStack;
		result.code = CTWing_HeartbeatTime_DecodeCmdDown(pClient, index, (AepHeartbeatTimeCmdData*)result.data);
	}
	else if (serviceId == AEP_SERVICE_ID_PROTECT_CMD) {
		result.serviceIdentifier = AEP_SERVICE_ENTIFIER_PROTECT_CMD;
		result.serviceId = AEP_SERVICE_ID_PROTECT_CMD;
		result.data = (void *)pClient->AepMallocProcessStack;
		result.code = CTWing_ProtectTime_DecodeCmdDown(pClient, index, (AepProtectTimeCmdData*)result.data);
	}
	else {
		result.serviceIdentifier = NULL;
		result.serviceId = 0;
		result.data = (void *)pClient->AepMallocProcessStack;
		StrToHex((char *)result.data, index, payloadLen);
		result.code = AEP_CMD_INVALID_DATASET_IDENTIFIER;
	}
	
	return result;
}

/**********************************************************************************************************
 @Function			AepCmdData CTWing_DecodeCmdDownFromBytes(CTWING_ClientsTypeDef* pClient, char* source, int len)
 @Description			CTWing_DecodeCmdDownFromBytes				: 反序列化数据包
 @Input				pClient								: CTWing客户端实例
					source
					len
 @Return				void
**********************************************************************************************************/
AepCmdData CTWing_DecodeCmdDownFromBytes(CTWING_ClientsTypeDef* pClient, char* source, int len)
{
	char * str = (char *)pClient->DataProcessStack;
	AepCmdData result;
	
	memset((void *)pClient->DataProcessStack, 0x0, sizeof(pClient->DataProcessStack));
	
	HexToStr(str, source, len);
	str[len * 2] = 0;
	
	result = CTWing_DecodeCmdDownFromStr(pClient, str);
	
	return result;
}

/********************************************** END OF FLEE **********************************************/
